[{"title": "Sunday Daily Thread: What's everyone working on this week?", "ID": "1cestbe", "author": "AutoModerator", "url": "https://www.reddit.com/r/Python/comments/1cestbe/sunday_daily_thread_whats_everyone_working_on/", "permalink": "/r/Python/comments/1cestbe/sunday_daily_thread_whats_everyone_working_on/", "score": 3, "ratio": 0.64, "num_comments": 15, "post_created": 1714262413.0, "body": "# Weekly Thread: What's Everyone Working On This Week? 🛠️\n\nHello /r/Python! It's time to share what you've been working on! Whether it's a work-in-progress, a completed masterpiece, or just a rough idea, let us know what you're up to!\n\n## How it Works:\n\n1. **Show & Tell**: Share your current projects, completed works, or future ideas.\n2. **Discuss**: Get feedback, find collaborators, or just chat about your project.\n3. **Inspire**: Your project might inspire someone else, just as you might get inspired here.\n\n## Guidelines:\n\n* Feel free to include as many details as you'd like. Code snippets, screenshots, and links are all welcome.\n* Whether it's your job, your hobby, or your passion project, all Python-related work is welcome here.\n\n## Example Shares:\n\n1. **Machine Learning Model**: Working on a ML model to predict stock prices. Just cracked a 90% accuracy rate!\n2. **Web Scraping**: Built a script to scrape and analyze news articles. It's helped me understand media bias better.\n3. **Automation**: Automated my home lighting with Python and Raspberry Pi. My life has never been easier!\n\nLet's build and grow together! Share your journey and learn from others. Happy coding! 🌟", "external_links": [{"title": "OP.GG - The Best LoL Builds and Tier List. Search Riot ID and Tagline for Stats", "description": "OP.GG - The Best LoL Builds and Tier List. Search Riot ID and Tagline for StatsLeague of LegendsBGamesDesktopTeamfight TacticsValorantPUBGBPalworldOVERWATCH2EsportsNGigsDuoTALKzendeskContact UsHelp CenterContact UsTheme Buttonen_USEnglish한국어日本語język polskifrançaisDeutschespañolNederlandsdanskSvenskaNorskрусский языкmagyarsuomiTürkçelimba românăportuguês简体中文繁體中文العربيةсрпски језикitalianoไทยTiếng ViệtEnglishLog InHomeChampionsGame ModeArenaUStatsLeaderboardsPro MatchesMulti-SearchMy PageOP.GGRegionnaNAEUWEUNEOCEKRJPBRLASLANRUTRSGPHTWVNTHNorth AmericaSearchGame Name +#NA1.GGOP.GGAbout OP.GGCompanyBlogLogo HistoryProductsLeague of LegendsGamesTeamfight TacticsValorantPUBGOVERWATCH2EsportsGigsDuoTALKAppsOP.GG for DesktopOP.GG Palworld for DesktopOP.GG Stats for AndroidOP.GG Stats for iOSOP.GG TFT for AndroidOP.GG TFT for iOSResourcesPrivacy PolicyTerms of UseHelpEmail InquiryContact UsMoreBusinessAdvertise© 2012-2024 OP.GG. OP.GG is not endorsed by Riot Games and does not reflect the views or opinions of Riot Games or anyone officially involved in producing or managing League of Legends. League of Legends and Riot Games are trademarks or registered trademarks of Riot Games, Inc. League of Legends © Riot Games, Inc.", "url": "https://op.Gg"}, {"title": "OP.GG - The Best LoL Builds and Tier List. Search Riot ID and Tagline for Stats", "description": "OP.GG - The Best LoL Builds and Tier List. Search Riot ID and Tagline for StatsLeague of LegendsBGamesDesktopTeamfight TacticsValorantPUBGBPalworldOVERWATCH2EsportsNGigsDuoTALKzendeskContact UsHelp CenterContact UsTheme Buttonen_USEnglish한국어日本語język polskifrançaisDeutschespañolNederlandsdanskSvenskaNorskрусский языкmagyarsuomiTürkçelimba românăportuguês简体中文繁體中文العربيةсрпски језикitalianoไทยTiếng ViệtEnglishLog InHomeChampionsGame ModeArenaUStatsLeaderboardsPro MatchesMulti-SearchMy PageOP.GGRegionnaNAEUWEUNEOCEKRJPBRLASLANRUTRSGPHTWVNTHNorth AmericaSearchGame Name +#NA1.GGOP.GGAbout OP.GGCompanyBlogLogo HistoryProductsLeague of LegendsGamesTeamfight TacticsValorantPUBGOVERWATCH2EsportsGigsDuoTALKAppsOP.GG for DesktopOP.GG Palworld for DesktopOP.GG Stats for AndroidOP.GG Stats for iOSOP.GG TFT for AndroidOP.GG TFT for iOSResourcesPrivacy PolicyTerms of UseHelpEmail InquiryContact UsMoreBusinessAdvertise© 2012-2024 OP.GG. OP.GG is not endorsed by Riot Games and does not reflect the views or opinions of Riot Games or anyone officially involved in producing or managing League of Legends. League of Legends and Riot Games are trademarks or registered trademarks of Riot Games, Inc. League of Legends © Riot Games, Inc.", "url": "https://op.Gg"}], "comments": ["Well, I guess I'll go first. I'm very new here, so I'm just working my way through the Python W3Schools tutorials.", "I've just added more layers to things and am thinking about ways to improve performance.\n\n[https://github.com/therealOri/PolyLock](https://github.com/therealOri/PolyLock)", "**Adding orjson support to python-json-logger** - strictly speaking this is on my fork of the library (see [#1](https://github.com/nhairs/python-json-logger/issues/1) for details)\n\nThe actual pr is here if anyone wants to provide feedback: https://github.com/nhairs/python-json-logger/pull/9", "Calculating average salaries for data scientists https://github.com/werowe/HypatiaAcademy/blob/master/pandas/pandas_statistics.ipynb", "I'm working on setting up a Local RAG for lanchain docs cz i'm first of all too lazy to read through docs everytime i need to find something, and on top of that, i'm too cheap to pay OpenAI for inference ![gif](emote|free_emotes_pack|grin)", "Working on tach! [https://www.reddit.com/r/Python/comments/1cgsopt/tach\\_a\\_python\\_tool\\_to\\_enforce\\_modular\\_design/](https://www.reddit.com/r/Python/comments/1cgsopt/tach_a_python_tool_to_enforce_modular_design/)", "Turning my python code into HTML/CSS/JS", "I want to create a database with tasks displaying common scenarios in Python for study.", "Automation + Web Scraping: Built a script to scrape  property address and rent data from zillow clone website and automated the data entry into google forms . This project was part of :100 Days of Code: The Complete Python Pro Bootcamp course on Udemy.", "Learning how to run my python automation inside a docker container.", "Final project for my BSc in Contemporary Software Development. A Python + Flask app intended for small agricultural operations (farms, homesteads, or just the vegetable patch in your back yard) that lets users record what happens and what they do, and then lets them ask questions of their own data in natural language. Using some local NLP and the Google TaPas model deployed on HuggingFace.", "This week, I've been working on PgQueuer, a Python job queue library using PostgreSQL. It manages concurrent jobs, recently handling over 5,000 jobs per second in benchmark tests. Check it out and share any feedback! \\[PgQueuer on GitHub\\](https://github.com/janbjorge/PgQueuer)", "Same 🤙🏼", "Oh this project looks interesting - especially for closed source code that is released to customers", "\nI see you've posted a GitHub link to a Jupyter Notebook! GitHub doesn't \nrender large Jupyter Notebooks, so just in case, here is an \n[nbviewer](https://nbviewer.jupyter.org/) link to the notebook:\n\nhttps://nbviewer.jupyter.org/url/github.com/werowe/HypatiaAcademy/blob/master/pandas/pandas_statistics.ipynb\n\nWant to run the code yourself? Here is a [binder](https://mybinder.org/) \nlink to start your own Jupyter server and try it out!\n\nhttps://mybinder.org/v2/gh/werowe/HypatiaAcademy/master?filepath=pandas%2Fpandas_statistics.ipynb\n\n\n\n------\n\n^(I am a bot.) \n[^(Feedback)](https://www.reddit.com/message/compose/?to=jd_paton) ^(|) \n[^(GitHub)](https://github.com/JohnPaton/nbviewerbot) ^(|) \n[^(Author)](https://johnpaton.net/)"]},
{"title": "Lad wrote a Python script to download Alexa voice recordings, he didn't expect this email.", "ID": "g53lxf", "author": "iEslam", "url": "https://i.redd.it/2s0dj8ob12u41.png", "permalink": "/r/Python/comments/g53lxf/lad_wrote_a_python_script_to_download_alexa_voice/", "score": 12344, "ratio": 0.98, "num_comments": 133, "post_created": 1587424299.0, "body": "", "external_links": [{"title": "OP.GG - The Best LoL Builds and Tier List. Search Riot ID and Tagline for Stats", "description": "OP.GG - The Best LoL Builds and Tier List. Search Riot ID and Tagline for StatsLeague of LegendsBGamesDesktopTeamfight TacticsValorantPUBGBPalworldOVERWATCH2EsportsNGigsDuoTALKzendeskContact UsHelp CenterContact UsTheme Buttonen_USEnglish한국어日本語język polskifrançaisDeutschespañolNederlandsdanskSvenskaNorskрусский языкmagyarsuomiTürkçelimba românăportuguês简体中文繁體中文العربيةсрпски језикitalianoไทยTiếng ViệtEnglishLog InHomeChampionsGame ModeArenaUStatsLeaderboardsPro MatchesMulti-SearchMy PageOP.GGRegionnaNAEUWEUNEOCEKRJPBRLASLANRUTRSGPHTWVNTHNorth AmericaSearchGame Name +#NA1.GGOP.GGAbout OP.GGCompanyBlogLogo HistoryProductsLeague of LegendsGamesTeamfight TacticsValorantPUBGOVERWATCH2EsportsGigsDuoTALKAppsOP.GG for DesktopOP.GG Palworld for DesktopOP.GG Stats for AndroidOP.GG Stats for iOSOP.GG TFT for AndroidOP.GG TFT for iOSResourcesPrivacy PolicyTerms of UseHelpEmail InquiryContact UsMoreBusinessAdvertise© 2012-2024 OP.GG. OP.GG is not endorsed by Riot Games and does not reflect the views or opinions of Riot Games or anyone officially involved in producing or managing League of Legends. League of Legends and Riot Games are trademarks or registered trademarks of Riot Games, Inc. League of Legends © Riot Games, Inc.", "url": "https://op.Gg"}, {"title": "OP.GG - The Best LoL Builds and Tier List. Search Riot ID and Tagline for Stats", "description": "OP.GG - The Best LoL Builds and Tier List. Search Riot ID and Tagline for StatsLeague of LegendsBGamesDesktopTeamfight TacticsValorantPUBGBPalworldOVERWATCH2EsportsNGigsDuoTALKzendeskContact UsHelp CenterContact UsTheme Buttonen_USEnglish한국어日本語język polskifrançaisDeutschespañolNederlandsdanskSvenskaNorskрусский языкmagyarsuomiTürkçelimba românăportuguês简体中文繁體中文العربيةсрпски језикitalianoไทยTiếng ViệtEnglishLog InHomeChampionsGame ModeArenaUStatsLeaderboardsPro MatchesMulti-SearchMy PageOP.GGRegionnaNAEUWEUNEOCEKRJPBRLASLANRUTRSGPHTWVNTHNorth AmericaSearchGame Name +#NA1.GGOP.GGAbout OP.GGCompanyBlogLogo HistoryProductsLeague of LegendsGamesTeamfight TacticsValorantPUBGOVERWATCH2EsportsGigsDuoTALKAppsOP.GG for DesktopOP.GG Palworld for DesktopOP.GG Stats for AndroidOP.GG Stats for iOSOP.GG TFT for AndroidOP.GG TFT for iOSResourcesPrivacy PolicyTerms of UseHelpEmail InquiryContact UsMoreBusinessAdvertise© 2012-2024 OP.GG. OP.GG is not endorsed by Riot Games and does not reflect the views or opinions of Riot Games or anyone officially involved in producing or managing League of Legends. League of Legends and Riot Games are trademarks or registered trademarks of Riot Games, Inc. League of Legends © Riot Games, Inc.", "url": "https://op.Gg"}], "comments": ["I’ll be honest, I was expecting a Cease and Desist from Amazon.", "Very cool. That’s the beauty of sharing. You never know who or how it will help someone, but you post it anyway because that’s just being awesome. \n\nThanks for sharing.", "This was posted publicly by [Michael Haephrati](https://www.facebook.com/photo.php?fbid=10220524693682311) on Facebook.\n\nUpdate: The lad is a Redditor! [**u/haephrati**](https://www.reddit.com/user/haephrati/)\n\nUpdate: The lad turned it into a [Software](https://www.facebook.com/pg/accexa2020/about/?ref=page_internal)!", "I feel that. It must be gratifying to do some good in the world, even if by accident. To diminish another's suffering just a little bit. RIP Mrs. Roberts.", "reminds me of that black mirror episode", "Beautiful! :-)", "If he has enough recording, he can ask a machine learning specialist to train a voice model of his mum.", "[deleted]", "AWWW!", "To be a hero, you don't need to save all the people.\n\nYou saved even only one person, to that person, you are the Hero.....", "Very nice!", "Heartwarming.", "I expected this to be way worse and be an email from Amazon warning him to cut the shit out. This is sweet and I'm glad he got a bit of comfort out if it.", "[deleted]", "Combine the voice recordings with Adobe's voice AI thing that can recreate a voice using just a few samples and he/she could have 'text to voice' mom audio!", "wow, that's awesome", "Coding can be used for whackadoodle stuff, but it is so nice to see when it is used for something wholesome, intentionally or not.", "On the one hand, that’s incredibly sweet, and it’s great to see how tech can positive impact people. On the other hand.. voice recordings taken without your knowledge? Personally wouldn’t want anyone keeping those unless I knew of it and consented at any given time I was being recorded. I wonder how much choice we’ll actually have in the matter in the next few years.", "I love my mom. (I am not the OP, this post made me emotional for some reason).", "Nobody's going to mention that Alexa is actually recording what you're saying? .... Seems like an invasion of privacy", "Think how much spam this guy must have gotten. You exposed your own and his email. lol.", "r/blackmirror", "I lost my mom when I was 14...i would do anything to hear her voice once again. \n\nKudos kid, you have done an awesome thing here, trust me.", "Shouldn't those recording be in a GDPR-mandated takeout archive without requiring a custom script?", "Just wait until Bezos realizes there there may be a demand for it.  \n\nFor only 14.95/month*** you can have your Amazon Elexa trained to respond in the voice of a dead loved one.\n\n\n*** Amazon prime membership required", "My mom passed almost 5 years ago and I wish this was a thing back then... That is a big deal as I don't have many recodings of her.", "When I saw Python, my dumb ass thought he wrote a Monty Python script.", "[deleted]", "That's awesome!", "Wholesome as fuck!  Thanks for sharing!!!", "Wow, that's awesome.", "❤️", "Man i would throw in an award if i had", "Maybe he will also be interested in the new [AI cloning voice](https://www.youtube.com/watch?v=0sR1rU3gLzQ) options out there.", "Omg a smart house situation.", "Now that it’s out there and people have seen it they’re filling and submitting it today.  People will have forgotten about it by the time someone looks at the cease n d’sis and these words will all be erased with grandma and us too", "The last good recording of my mom’s pre-stroke speech patterns is my parents’ home answering machine. My dad didn’t replace it until he absolutely had to.  When it was ready to die, thankfully I could still get the speaker to play loudly enough that you could hear it.\n\nThey don’t use a local answering machine anymore (thanks, Xfinity), but we have it. It’s been 20 years come August.", "This is so wholesome it made my day", "Can you imagine leaving your loved ones a surprise message in the recordings to be found later?", "I curse at Alexa when she doesn't do what I want, which is basically all the time.  It's interesting to think about someone archiving those recordings and listening to them fondly after I've died.", "Crying. Wish I could have had this for my dad.", "The September 19 2019 episode of the Endless Thread podcast describes a similar case.", "With NNs we our loved ones will live on.", "I have an Amazon Echo dot and have used it to ask it questions. What exactly are \"Alexa Voice Recordings\"? Does everything I ask it get recorded and archived somewhere that I can later download?", "Everyone likes that", "F", "NGL this one made me tear up a bit. That’s just awesome.", "*phew* boi. That escalated quickly!", "Oh crap, I need to add Alexa to my dead man's handle. My family isn't ready.", "Clickbait-like title.", "This gave me chills. Python FTW!", "That’s truly amazing. I’m so glad that your work helped someone out this much. Good for you.. and them 🙂", "Dang, thats so good!", "At the beginning I thought Alexa sent this email or something scary", "I twitted a screenshot of this to Bezos. Lets see if he responds. Haha", "Nice", "honestly i was expecting a job offer from amazon or smth like that, good job though", "*Forward 10 years:* Lad wrote a Python script to create a Alexia personality based on Alexia voice recordings of his long passed mother. Regrettably like his real life mother who nagged him  his entire life  the Alexia personality nagged him every time he made a purchase from Amazon or watched a movie. The man despondent  committed suicide by hanging, while the Alexia personality repeated,*\" I told you so\"* over and over again.", "[deleted]", "Why didn’t you blank out his name and his email completely? You can totally still read his email, and confirm this with his name. I would suggest you take this image offline", "as someone whos starting to learn python this gives me a good motivation thanks", "omg me too!", "That's the next email in his inbox.", "[deleted]", "it's never too late, don't give them ideas\n\nI'll be honest, I was expecting that Amazon could be nice to that poor guy and just send him an archive with all the recordings", "Same haha", "Yeah!", "Same", "hear, hear", "100% same", "OMG same", "That's what I was waiting for. That's an awesome unexpected response", "I didn't know it was possible to recover voice recordings. Is this possible with Siri? I've asked Siri questions while balls deep before.", "Link to the script?", "[deleted]", "Which one again? I'm guessing Be Right Back but feels different.", "I'm getting flashbacks to the episode of how I met your mother where Marshall only has a voice message from his dad...", "We're like 2 steps away from Black Mirror universe.", "Such as this one\n\nhttps://youtu.be/DWK_iYBl8cA", "There are an app that can make a chat bot based on a chat history, too.", "Not the only thing it recorded his mom doing", "\"Not all hero's wear capes\" (and I'm not trying to be funny, this was in all seriousness)", "Or the recordings could have been embarrassing. \"Alexa, what's the spit roast position?\"", "You can listen back to them on the website and provide feedback about whether Alexa did what you asked her to.", "I've been working towards this very thing. I have a short answering machine recording from my now deceased mother.  The \"Deep Fake\" algorithms have been what I'm targeting to use.  Just starting this so not far yet.  So many projects, so little time!", "Well, people do accept it by accepting the terms...", "I thought I couldn't be the only one who thinks this is more creepy than adorable. The bigger implications are right under your nose.", "You'd have to be pretty gullible to believe this wasn't happening", "It should be. Even if that were the case, I don't think the respondent is European.", "None of this is okay but we're gonna call it heartwarming because it's about a mom", "well not too dumb considering python is named that because of Monty Python", "Yeah... ever heard of \"My Activity\"?", "𝓷𝓲𝓬𝓮 ☜(ﾟヮﾟ☜)\n#Nice Leaderboard\n**1.** `u/spiro29` at **9999 nices**\n\n**2.** `u/RepliesNice` at **8923 nices**\n\n**3.** `u/Manan175` at **7099 nices**\n\n**...**\n\n**247777.** `u/sachin_55` at **1 nice**\n\n---\n\n^(I) ^(AM) ^(A) ^(BOT) ^(|) ^(REPLY) ^(**!IGNORE**) ^(AND) ^(I) ^(WILL) ^(STOP) ^(REPLYING) ^(TO) ^(YOUR) ^(COMMENTS)", "What?", "There's no need to be cynical, I can't cash out that karma if I wanted to and my children won't inherit it, the \"lad\" knows about this thread, he was also [credited](https://www.reddit.com/r/Python/comments/g53lxf/lad_wrote_a_python_script_to_download_alexa_voice/fo12gp8/), it gave him so much motivation, he turned his script into a [Software](https://www.facebook.com/pg/accexa2020/about/?ref=page_internal).", "I as well haha", "me too haha", "[deleted]", "> If you have posted something on Facebook and later published it elsewhere, Facebook has the legal ground to sue you\n\nThis is a myth, you're just repeating silly internet conspiracy theories.", "As others have pointed out, your FaceBook post example is wrong. Think about it this way, if a tech company were to claim what you post is legally theirs, every single post on their platform is a liability to them. They wouldn’t want to be sued for what you posted; that’s why they try to police their services.", "You can download all your data from Facebook in bulk for years by now.", "Or you looked into it too much and became a bit too paranoid, like a lot of guys who were paranoid about governments of representative democracies, and less paranoid about totalitarian governments or powerful corporations who collect everything without any limits.\n\nYes Alexa, and other systems collect too much data, but the principle should be about when they do something wrong with that information, i.e., the abuse of information. It's impossible to stop them from recording data.", "I work for Alexa and I would be happy to facilitate that. I don't have access to these things but I can drive a project to make it easier. Maybe even make the Python script work for everybody.", "Balls deep in Siri?", "At least for Google you can go back and listen to everything you told Google. Even just using text to speech. Pretty creepy", " [https://www.codeproject.com/Articles/5249524/Hacking-Alexas-Voice-Recordings](https://www.codeproject.com/Articles/5249524/Hacking-Alexas-Voice-Recordings)", "I’m a bit confused, in what ways are “David’s” personal details exposed?", "Where she loses her husband", ">Be Right Back\n\nIt was actually smithereens", "Ive already trained a model of my own voice. I just need to give it a brain", "This is concerning.", "[removed]", "And buying the thing...", "It's not feasible to limit GDPR takeout to europeans, so it is usually available to all.", "Really? Nice!", "\n\nHow long would it take the Amazon's engineers to create a AI based on past Alexia voice recordings? I based this idea or short story on this articles. \n\n[A Son’s Race to Give His Dying Father Artificial Immortality](https://www.wired.com/story/a-sons-race-to-give-his-dying-father-artificial-immortality/)\n\nhttps://www.npr.org/2017/07/23/538825555/creating-a-dadbot-to-talk-with-a-dead-father", "[deleted]", "The only ones I know if that actually do claim copyright are Stack Overflow and Wikipedia, and they claim copyright but licence it under a FLOSS licence.", "Yeah.  The reality is actually the reverse: if *Facebook* uses the material elsewhere, *you don't* have the grounds to sue *them* (if the agreement is upheld, anyway).\n\nIOW, you aren't agreeing to limit your own use; you are agreeing *not* to limit FB's.\n\nWhich is also pretty shit, and quite inline with the unofficial motto they've always had: *Fuck privacy.  Everything about you should be 100% public, always...especially in terms of access by government surveillance agencies and big business.*", "[deleted]", "Don't worry about it", "His email address?", "Well you get his full name", "Okay so that's the one.", "How did you do it .Any resources you can point me to?", "Certainly!  I've been focusing more GUI solutions for video based AI problems, but now that you've reminded me of this project, I'll keep an eye out for this audio one as well.  I could just as easily add a GUI front-end to an audio tool.  Thanks for the reminder.  It's back on my radar again.", "...and not really thinking about what they accepted.. and shouldn’t there be an opt out?", "Didn't know that. Thanks for clearing that up for me.", "The documentation is also filled with Monty Python'isms.\n\nThe debugger is called Idle, for a certain member of the clan, as well.", "Haha yeah, despite the icon being a snake, Monty Python is the origin.\n\nhttps://docs.python.org/3/tutorial/appetite.html\n\n>By the way, the language is named after the BBC show “Monty Python’s Flying Circus” and has nothing to do with reptiles. Making references to Monty Python skits in documentation is not only allowed, it is encouraged!\n\nhttps://wiki.python.org/moin/CheeseShop\n\n>The secret code name refers to the Cheese Shop sketch performed and recorded by John Cleese and Michael Palin on 7 January 1972.", "nice", "[deleted]", "If you want an example of a \"We own everything license\" check out Grammerley. I won't touch them with a barge pole.", "Unless the EU can watch over them while they do it, my bigger worry is about bad guys, who will say \"sure we deleted it\" and then don't.", "I get the feeling that the name \"David Roberts\" doesn't really narrow it down enough to actually dox the man.  That's a super generic name.", "Any update??", "Nope, it's common knowledge that big companies will store anything you do..", "𝓷𝓲𝓬𝓮 ☜(ﾟヮﾟ☜)\n#Nice Leaderboard\n**1.** `u/RepliesNice` at **7119 nices**\n\n**2.** `u/spiro29` at **6133 nices**\n\n**3.** `u/GreenAppleCZ` at **5081 nices**\n\n**...**\n\n**270019.** `u/ashhy-ashhy` at **1 nice**\n\n---\n\n^(I) ^(AM) ^(A) ^(BOT) ^(|) ^(REPLY) ^(**!IGNORE**) ^(AND) ^(I) ^(WILL) ^(STOP) ^(REPLYING) ^(TO) ^(YOUR) ^(COMMENTS)", "[deleted]", "[deleted]", "Erm some people will assume the worst, but others assume companies will respect you and your rights.. doesn’t come out nicely for the latter group", "my first nice :)", "[deleted]", "* Regulations without teeth are called bad regulations.\n* Regulations without verification are bad regulations.\n* Regulations designed to snuff out capitalist competition are called monopolizing regulations and are bad regulations.\n* Regulations that give you a false sense of security, while giving popularity and votes to the politician who wrote them, are called bad regulations or fake regulations.", "[deleted]", "[deleted]", "[deleted]", "You're stupid if you think those fines mean they are abiding by it. How utterly stupid do you have to be to think they are being honest there. They probably pay the fines because it's way cheaper than the profit they make just to continue to stay in the good graces of some.\n\nHow utterly stupid do you have to be? Do you think the Irish police go in there and check exactly what they're doing? Nope. If they wanna hide it, they can easily hide it. It's because of stupid people like you who think these laws work.\n\nIf they did something truly bad that could get them in serious legal heat, they'll be like \"woops we lost all the harddrives.\"\n\nThe whole point, because you're so incredibly stupid that you didn't even understand, is that regulations must have teeth and must be very good at investigation.", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]"]},
{"title": "This post has:", "ID": "hoolsm", "author": "Krukerfluk", "url": "https://www.reddit.com/r/Python/comments/hoolsm/this_post_has/", "permalink": "/r/Python/comments/hoolsm/this_post_has/", "score": 9232, "ratio": 0.91, "num_comments": 437, "post_created": 1594386373.0, "body": "9777 upvotes,\n\n967 downvotes\n\nand 452 comments!", "external_links": [{"title": "OP.GG - The Best LoL Builds and Tier List. Search Riot ID and Tagline for Stats", "description": "OP.GG - The Best LoL Builds and Tier List. Search Riot ID and Tagline for StatsLeague of LegendsBGamesDesktopTeamfight TacticsValorantPUBGBPalworldOVERWATCH2EsportsNGigsDuoTALKzendeskContact UsHelp CenterContact UsTheme Buttonen_USEnglish한국어日本語język polskifrançaisDeutschespañolNederlandsdanskSvenskaNorskрусский языкmagyarsuomiTürkçelimba românăportuguês简体中文繁體中文العربيةсрпски језикitalianoไทยTiếng ViệtEnglishLog InHomeChampionsGame ModeArenaUStatsLeaderboardsPro MatchesMulti-SearchMy PageOP.GGRegionnaNAEUWEUNEOCEKRJPBRLASLANRUTRSGPHTWVNTHNorth AmericaSearchGame Name +#NA1.GGOP.GGAbout OP.GGCompanyBlogLogo HistoryProductsLeague of LegendsGamesTeamfight TacticsValorantPUBGOVERWATCH2EsportsGigsDuoTALKAppsOP.GG for DesktopOP.GG Palworld for DesktopOP.GG Stats for AndroidOP.GG Stats for iOSOP.GG TFT for AndroidOP.GG TFT for iOSResourcesPrivacy PolicyTerms of UseHelpEmail InquiryContact UsMoreBusinessAdvertise© 2012-2024 OP.GG. OP.GG is not endorsed by Riot Games and does not reflect the views or opinions of Riot Games or anyone officially involved in producing or managing League of Legends. League of Legends and Riot Games are trademarks or registered trademarks of Riot Games, Inc. League of Legends © Riot Games, Inc.", "url": "https://op.Gg"}, {"title": "OP.GG - The Best LoL Builds and Tier List. Search Riot ID and Tagline for Stats", "description": "OP.GG - The Best LoL Builds and Tier List. Search Riot ID and Tagline for StatsLeague of LegendsBGamesDesktopTeamfight TacticsValorantPUBGBPalworldOVERWATCH2EsportsNGigsDuoTALKzendeskContact UsHelp CenterContact UsTheme Buttonen_USEnglish한국어日本語język polskifrançaisDeutschespañolNederlandsdanskSvenskaNorskрусский языкmagyarsuomiTürkçelimba românăportuguês简体中文繁體中文العربيةсрпски језикitalianoไทยTiếng ViệtEnglishLog InHomeChampionsGame ModeArenaUStatsLeaderboardsPro MatchesMulti-SearchMy PageOP.GGRegionnaNAEUWEUNEOCEKRJPBRLASLANRUTRSGPHTWVNTHNorth AmericaSearchGame Name +#NA1.GGOP.GGAbout OP.GGCompanyBlogLogo HistoryProductsLeague of LegendsGamesTeamfight TacticsValorantPUBGOVERWATCH2EsportsGigsDuoTALKAppsOP.GG for DesktopOP.GG Palworld for DesktopOP.GG Stats for AndroidOP.GG Stats for iOSOP.GG TFT for AndroidOP.GG TFT for iOSResourcesPrivacy PolicyTerms of UseHelpEmail InquiryContact UsMoreBusinessAdvertise© 2012-2024 OP.GG. OP.GG is not endorsed by Riot Games and does not reflect the views or opinions of Riot Games or anyone officially involved in producing or managing League of Legends. League of Legends and Riot Games are trademarks or registered trademarks of Riot Games, Inc. League of Legends © Riot Games, Inc.", "url": "https://op.Gg"}], "comments": ["scale tap piquant quiet advise salt languid abundant dolls long -- mass edited with redact.dev", "Good job. But honestly, add a sleep timer of a few seconds. This will eventually get your IP banned on reddit if you bombard them with too many requests.", "Cool! Could you share it?", "This is awesome. I want to just upvote it but I can't resist upvoting, refreshing, downvoting, refreshing ad infinitum.", "how often does it refresh? seems like it's changing quite a bit!", "This comment has:\n\n42 characters\n\n1 colon\n\n101 upvotes", "I just want to make to comments go up by one with this comment. Nice post", "Comment", "I think it broke", "I wonder how many refreshes it has...", "Testing for 54 comments,,,\n\nEDIT: It Worked!", "I wonder why the real upvote net total is 1 more than the displayed message. Did you round up or down somewhere?", "I am gonna be that guy but Is this open sourced? I wanna see how other people make reddit bots", "Just checking if the comment number goes up\n\nEdit: this is me 2 mins after posting original comment and it's still didn't go up.", "nice", "Wow", "Wow! Good job.", "Cute", "13", "Add one", "Very cool thing, nice job", "test", "Now it has 17 comments", "Well done", "Cool", "boop", "this is dope!", "haha this is cute! nice job :)", "Hi :)", "Test", "35?", "Beep", "It’s super wrong now :)", "So cool OP! How long did this take you to build?", "You're lying to me, this post has 697 upvotes!!\n\n^/s", "\\+1 to the comment count!", "V.Nice", "(:", "Hmm +1 comment", "74", "I was gonna do this but couldn't figure out how to make a bot take over my acc, could you share the code?", "lol", "Hi ,what does praw do?", "84th comment. Let's see if the post shows this...", "I down voted to see the number but it didn't change so keep my down vote", ":\\^)", "Nice", "Comment", "Well done", "So sick!", "Wow dude! Great job. Keep up the creativity and good work", "Comment", "Commenting just to test it", "Testing", "120*", "Guessing this is a python script also commenting to see how fast it is", "Test", "Up", "Test", "woah dude", "How did you do this?", "nice", "Hu", "I just wanna see the comment count go up", "141 comments*", "neato", "Here I am toggling the upvote and downvote buttons to see it change. I love this", "yo who are the 300-350 ish people downvoting this? this is fucking cool", "Are you just scraping the page every so often and edit the post? Can you edit posts.....I dont think you can.", "Yes", "Cool!", "I hate that the tester in me had to upvote and down vote multiple times to watch the counts. Definitely not commenting to see the count jump to 150 either.", "Ass", "This is sick", "Okay this is pretty cool", "Hi", "Nice", "lol", "Fancy", "No there isnt", "Who would downvote this!?   Seriously, explain yourselves downvoters", "How?", "+1", "How do you go about doing this? I want to\nLearn a little :)", "Nice, I wanna see the counter go up", "cool", "What happens if you get an award?", "Cool", "178th comment gang", "ok", ".", "182", "Adding a comment to make sure it changes", "Wow", "187th comment", "I just wanna be a part of the comment counter.", "lets check how fast it updates itself", "quite fast", "The question is can it detect fake downvotes?", "Can I do this on facebook?", "Test", "Test 2", "No", "Test", "hohoho!!! This is amazing! Bringing up the comment count to 199!", "How it works? Is it showing the real value of upvotes and downvotes?", "Let me test something", "Hi", "Test", "A coment to see if the counter change", "This is very nice.", "210 comment", "test comment", "Test", "Numbers!!!", "This is really ducking cool.", "am i the only one who sees a higher number of upvotes in the post than the amount that the reddit app shows me edit: forget is, i forgot to subtract downvotes", "J", "Wait if you create a statistic from the amount of karma and the amount of upvotes/downvotes, over time maybe you could find out the sacred karma algorithm..", "222 ya punk", "No it doesn't", "THAT IS SO COOL\n\nBut how does it work... It doesn't say edited on it...", "Lol", "This feel oddly simular to braking the 4th wall, but this situation is not called that... unless it is? Cyber wall? breaking the Cyber wall? I don't know. It's cool though.", "what", "## # ##", "Wow! Very cool but uh the upvotes are wrong", "Is this live??", "Test", "cool", "237", "Nice", "Comment", "Comment", "This is cool, any source code?", "Cool", "Just a test", "So, my app is showing 4.2k upvotes, but your script has 4762 upvotes and 589 down.  Are you counting total votes instead of upvotes?", "Damn", "Who would’ve thought", "No", "how do you upload this to reddit", "Gg", "Hhk", "a", "a", "Wot", "u/Visfire stole this and put it on r/teenagers", "261 comments now.", "Hey dude, some asshole stole this and put it in r/teenagers. But I like this idea, and this is awesome!", "This is epic", "This is cool", "wak", "Now it's 268 comments.", "+1", "Test", "ok", "Test", "Nice", "Dat awkward moment when I leave a comment so the post is inaccurate", "test", "Cool bot dude!", "278 now?", "Peeeeebis", "Does it now?", "Test", "Here I am, trying to figure out if I should update cuz it's cool, or downvote to test it", "That actually really cool. We can see how upvotes are fudged too", "I thought that reddit didnt disclose the ratio and obfuscated the karma number?", "290th", "Test", "Reddit should start showing number of downvotes it feels Facebook type platform without that", "Comment #294", "gg", "299", "Butts", "T", "This is the kind of content I like to see on this subreddit lmao", "Hi everyone =)  \nCheckout my new project on Python [https://github.com/Alex014/CryptoContainer](https://github.com/Alex014/CryptoContainer)  \nIt's an encrypted messaging system", "306", "307", "No!", "Let me check", "Comment", "just checking!", "Whoa! This one is amazing!", "#include <test_comment>", "Why so many downvotes?", "Test", "you should have your bot make random callouts of users\n\nhey /u/jpflathead what's with the downvote?  \nhey /u/jpflathead watch your language!  \nhey /u/jpflathead thanks for the bitcoin!", "Make it one more", "Welcome to the wonderful world of APIs!", "testing comment count", "Not completely accurate, but that can be reddit sucking dick", "Test", "very cool!!!", "I feel like this is inadvertent bait but im falling for it anyway", "are you sure???", "really?", "Great work but how'd you do that?", "339th comment, just testing that it still works...", "340?", "this is the good shit", "Testing 123", "Great", "You are updating it very often, it seems. Doesn't Reddit API consider this flood?", "Really huh", "This is so cool! Well done, how did you do this?", "Poop", "[deleted]", "test", "This is so cool! Good job.", "Test", "woah", "Hello", "852 ᴄᴏᴍᴍᴇɴᴛs ʏᴏᴜ sᴀʏ?", "353th comment", "Just checking", "I'm late, but 355.", "nice!", "Cool", "Let's test it", "can someone link a tutorial to write something that does this", "M", "363", "Damn", "This is amazing!", "hi", "Nice", "No", "Cool", "Just commenting to increase the comments", "up the comment", "Commenting just to see if this gets updated.", "385", "Lol", "386 comments test...?", "I upvoted, but it didn't change. :/\n\nIs it not instant?", "Awesome stuff man.", "Lol", "testing", "Comment", "Test", "Is this script still running?", "Wait, I’m so confused", "394", "nice", "when it rains it pours", "Awesome", "Q", "pog", "h", "Hmmmm\n\nDoes this update in real time?\n\nStill, great job!", "Does it update fast enough!", "Wow", "Fuck off", "o", "Test", "Test", "Yeet", "417\\*", "Epic", ":o", "Testing testing 123", "422", "Test", "Pog", "This is really impressive... and comments goes up by 1", "Ok", "Test", "I want in too", "Nice", "Checking", "wowzas", "hello", "Test", "Jyst checking speed", "Ok", "437", "test", "still", "Test", "Test", "testing", "Test.", "Noice.", "Is this still running? Lol", "try adding comment", "Yeet", "446 comments now >:)", "Wut", "Did I just get hacked? Can you see my screen?", "449th comment", "G", "Cool.", "Test", "452 baby!", "453 now", "This post has Ligma", "impressive !", "wow nice", "Cool", "Nice", "No it doesn't It has 2916 currently", "454", ":( it's wrong", "wow", "![img](emote|t5_2qh0y|600)", ".", "yep", "Also carykh's video where the thumbnail is the most upvoted comment of the last 24 hours!", "This reminds me of another Tom Scott video where the likes on a tweet keep going up and down, because thats what's happening.\n\nhttps://youtu.be/RY_2gElt3SA", "So right.", "The API wrapper (PRAW) takes care of that. No need to add additional sleeps.", "Next up: broadcast the ascii version of star wars by editing a reddit post at 30Hz.", "Its editing a submission not posting. Thats what I wondered too though, would it eventually get rate limited. But I can't imagine editing a submission would trigger a rate limit. I don't actually know.", "    import praw\n    \n    reddit = praw.Reddit(\n        client_id='***',\n        client_secret='***',\n        username='***',\n        password='***',\n        user_agent='***')\n    \n    while True:\n        submission = reddit.submission(id='***')\n        ratio = submission.upvote_ratio\n        ups = round((ratio * submission.score) / (2 * ratio - 1)) if ratio != 0.5 else round(submission.score / 2)\n        downs = ups - submission.score\n        edited_body = str(ups) + ' upvotes,' + '\\n\\n' + str(downs) + ' downvotes' + \"\\n\\n\" \"and \" + \\\n                      str(submission.num_comments) + ' comments!'\n        submission.edit(edited_body)\n    \n\nI'm new to python so there is probably a better way to do this", "It runs a pull every X seconds then updates the message.\n\nOP posted the code higher up.", "[deleted]", "Is your bot broken? I see 106 upvotws", "Reddit fuzzes upvote counts a bit, so it will be a little off sometimes", "He posted the code above", "*18 and 239 updoots", "75", "Check out praw (python reddit api wrapper). Fairly easy, tbh :).", "Python reddit api wrapper", "Wow it did change", "[removed]", "Somebody already done it [here](https://www.youtube.com/watch?v=dQw4w9WgXcQ)", "Also how long does it take to update?", "4856-600 is 4256 how are they wrong", "The 4.2k was them added together. Separately it has 4762 upvotes and 589 downvotes.", "Can confirm, it does", "Pretty cool, OP!", "wow it workd", "[deleted]", "Epic", "Adding number of cross posts would be cool", "yup cock", "But aren't very big systems built with a reliable way to avoid that?", "In the case of reddit there's actually more going on. Reddit deliberately \"fuzzes\" the values of upvotes up and down to obfuscate the true vote count.", "Unless the throttling algorithm is outlined in praw docs, my own personal style would be to manually set a reasonable wait period just to have more control. If the reddit api  ever changes, there will be a delay to updated praw code getting pushed.", "That sounds amazing but I'm sure the api limiter is well below that, maybe 1 request per second", "That's still a request. Yes, it will get rate limited.", "`submission = reddit.submission(id='***')` This line looks like a request to me. How else is he going to get the up-to-date stats? Also as the other poster said, submitting is still a request.", "You're great at figuring stuff out.", "I bet you sweat glitter.", "add a sleep there for a minute or two just not to kill your API access", "github.\n\nalso replace that string concatenation with an f string and you don't need all string casting with this method and its the fastest & most readable way to do it\n\n    edited_body = f'{ups} upvotes, \\n\\n {downs} downvotes \\n\\n and {submission.num_comments} comments!'\n\nedit: fstrings are the fastest: https://realpython.com/python-f-strings/", "Kudos for the script. It's always fun to see live data :)\n\nHere's my proposal. Didn't test everything since I don't have the credentials and stuff but it will give you the gist on how the design to transform it into a reusable CLI.\n\nThanks for sharing the source.\n\n    import os\n    import argparse\n    import praw\n    \n    \n    CLIENT_ID = os.environ.get('CLIENT_ID')\n    CLIENT_SECRET = os.environ.get('CLIENT_SECRET')\n    USER_AGENT = os.environ.get('USER_AGENT')\n    \n    \n    \n    def get_reddit_client(\n            username,\n            password,\n            client_id=None,\n            client_secret=None,\n            user_agent=None,\n            ):\n    \n        if not client_id:\n            client_id = CLIENT_ID\n        if not client_secret:\n            client_secret = CLIENT_SECRET\n        if not user_agent:\n            user_agent = USER_AGENT\n    \n        reddit = praw.Reddit(\n            client_id=client_id,\n            client_secret=client_secret,\n            username=username,\n            password=password,\n            user_agent=user_agent)\n    \n        return reddit\n    \n    def main(args):\n        args.username\n        args.password\n        reddit = get_reddit_client(\n            args.username,\n            args.password,\n            args.client_id,\n            args.client_secret,\n            args.user_agent,\n            )\n    \n        while True:\n            subm = reddit.submission(id=args.id)\n            if subm.upvote_ratio != 0.5:\n                ups = round(\n                    (subm.upvote_ratio * subm.score) / (2 * subm.upvote_ratio - 1))\n            else:\n                ups = round(subm.score / 2)\n            downs = ups - subm.score\n    \n            edited_body = (\n                '{} upvotes\\n\\n'\n                '{} downvotes\\n\\n'\n                '{} comments\\n\\n'\n                )\n            edited_body = edited_body.format(ups, downs, subm.num_comments)\n    \n            subm.edit(edited_body)\n    \n    if __name__ == '__main__':\n        parser = argparse.ArgumentParser(\n            prog='reddit_stats', description='Track and Post reddit stats')\n    \n        parser.add_argument(\n            'id', type=str, help=\"reddit post's id\")\n        parser.add_argument(\n            'username', type=str, help=\"reddit's account username\")\n        parser.add_argument(\n            'password', type=str, help=\"reddit's account password\")\n        # Let user override values source from the environment variables\n        parser.add_argument(\n            '-ci', '--client_id', type=str, help=\"reddit's api client_id\")\n        parser.add_argument(\n            '-cs', '--client_secret', type=str, help=\"reddit's api client_secret\")\n        parser.add_argument(\n            '-ua', '--user_agent', type=str, help=\"custom user agent\")\n    \n        args = parser.parse_args()\n        main(args)\n\nEdit: Typo", " \n    client_id='hunter2',\n     client_secret='hunter2',\n    username='hunter2',\n    password='hunter2',\n    user_agent='hunter2'\n\nAm I doing this right?", "I would've used string formatting for the edited_body as it's more robust and looks cleaner but other that great! Thanks for sharing!", "Basically fine. The only significant change I'd recommend is moving your credentials to an external config file. There's actually a recommended pattern for doing this specifically for praw: https://praw.readthedocs.io/en/latest/getting_started/configuration/prawini.html", "A lot less code than I thought. Cool!", "Whwre do you run this script?", "You should probably change your password after posting it here!", "Use string formatting so that it looks prettier.", "I did not know you could edit posts with praw", "why does while True not cause an infinite loop error or whatever?", ">import praw\n\n*District 9 intensifies*", "Why didn't you use submission.score for upvotes ?", "[deleted]", "You're new and you made this?\nThe hell do you call experienced!!", "Cool! Could you share it?", "This one doesn't...", "Cool", "Joke's on you, I middle-clicked it so I saw the title of the page before actually going on it haha\n\n&#x200B;\n\nI still listened to it out of respect", "I’m an idiot.", "would be levels more challenging too", "What makes a system \"very big\" is that it's spread across hundreds of machines. If 500 machines each process a sliver of the likes on a video, and you want to get a 100% accurate tally, you'd have to stop all 500 of them to ask them how many likes they saw, which defeats the purpose of having many machines in the first place. Instead they use eventual consistency: the answer is always close enough, and once everything calms down it'll be exactly correct.\n\nFor a less simplified answer, watch the video", "Yeah but sometimes there's too many people upvoting or liking at the same time, so the servers aren't able to count them properly. Until people stop upvoting and the main server can finally count. That's as far as I understood.", "Here's the code: https://github.com/praw-dev/prawcore/blob/34c153ec6706a87782898d404042ddbd5a847b57/prawcore/rate_limit.py\n\nReddit's API lets you know how many requests you have left and how much time you have until the limit resets. PRAW pretty much just divides time left by requests left and sleeps that amount. It does a little extra magic for detecting if multiple clients are running, but that's the jist of it.", "Client libraries that handle rate limits based on exponential back off or HTTP headers are super common these days. I wouldn't think twice of relying on these and not building my own", "Did some digging and apparently PRAW has inbuilt throttling to mitigate getting hit with rate limiting on requests. apparently.", "I was just wondering if editing an existing submission would be limited differently to a new submission.", "Just added an 90sec delay \n\nthanks for the tip!", "PRAW throttles requests based on response headers", "PRAW takes care of following the rate limit for you, so no need to add extra sleeps.", "f strings deserve to be wayyy more popular. Shame they only became a thing very recently in 3.6, so many tutorials won't have had it.", "I know a lot of people like arg-parse, but python-fire is actually awesome: https://github.com/google/python-fire", "Hey , do you have a quick explanation for the references you imported?", "f-strings are much more readable!", "I just see ******* ?", "Nah f strings are the only way to go.", "Quick q: Do you know what style/paradigm this kind of string interpolation follows?\n\n`my_pictures: %(my_dir)s/Pictures`\n\nIs it just C style?", "The string under the *** is https://youtu.be/dQw4w9WgXcQ", "You can't, Reddit automatically blurs out your password. My password is \\*\\*\\*\\*\\*\\*. See?", "Yeah here is the code:\n\n``` import manually_check_your_reddit_account_for_upvotes as mu```\n``` mu.comment_reflect_upvotes()```", "What kind of fettish is that?", "I just assumed there would be a something in praw for that", "Damn that’s smart.", "It does indeed!", "You have the best laugh.", "You should be thanked more often. So thank you!!", "Depends on what you mean. Editing is just affected by the general rate limit of the API as far as I'm aware, while new submissions have a spam limit which is waaaaay lower. Making 5 posts within a minute will probably get you blocked for ~15min. Especially on new low karma accounts.", "How is it that you always look great, even in sweatpants?", "When you make a mistake, you try to fix it.", "90s isn't even necessary. 5s or something is fine as well, just continuously is bad. Reddit is pretty lean, but if you're too hardcore they will block you too.", "This is something I wouldn't expect from an API library if I only picked it up.\nA welcome change in a sea of mediocrity", "V", "Right, since it's not backward compatible, including them means a lot of people not running the latest python will be confused why it doesn't work.", "Python 3.6 is 3.6 years old now.", "I love em. People might not use them as much because the concept is a little weird and you have to mind your quotation marks.\n\nThe only other issue is being able to make a formatted template with them since the variable needs to be present. I *think*, anyway. Have you tried making templates at all?", ">https://github.com/google/python-fire\n\nDo you really need to install six, termcolor and whatever to just normalize the arguments for this tiny script?\n\nDidn't know about this lib and i will definitively take a look since it's from Google but IMHO:\n\nthis culture of injecting unnecessary sub modules just to fix one thing that the core lib already does is something for node/javascript projects.", "I don't know if I understood your question but:\n\n\\- **os** is to source the env vars\n\n\\- **argparse** is the core module to parse command args.\n\n\\- **praw** is was imported on the original snippet so ...", "Template strings or f strings are both powerhouses, although not very efficient I believe.\n\nPeople down voting are those that don't know what template string means..", "I think everyone knows what this is.", "I think he just wants that guys colon", "never even heard of PRAW before this, but I'm sure it has something for it!", "And OP doesn't have to do anything because PRAW automatically takes care of following the rate limit.", "I'm finishing a Codecademy course, and learned fstring outside of it. I've bashed my head against their interfaces a few times thinking something was wrong with my fstring, when in reality they are running a lower python version. : (", "I think I have run into the problem you're talking about. Where rather than putting a big f string deep writhin some function, I want to make it something like a global constant, but I can't do that because of variable bindings. I've actually resorted to top-level functions that are just defined to be f strings in those cases. Not great though.", "It is a nice project that makes adding CLI capabilities simple and easy. I prefer the developer efficiency. Should I use urllib instead of requests? maybe, but if it works and I don't have to think about it, good.\n\nHere is my repo of little fun examples of python fire and other stuff stuff. https://github.com/manvillej/fun_examples/tree/master/google_fire", "Six is a pretty small library that's included almost everywhere these days, so if you have any third-party library, it's very very likely you already have that dep satisfied anyways. Any library that is both py2 and py3 compatible will most likely need six.\n\ntermcolor absolutely makes sense. This isn't really just normalizing arguments, it's a library for \"automatically generating command line interfaces (CLIs)\". CLIs are in the terminal, so yes, termcolor is a very relevant dependency.\n\nThis has nothing to do with the node culture, where they will literally import dependencies for single functions. six and termcolor are highly specialized code that you absolutely do not want to create from scratch.", "You understood it correctly thank you . Still the question stands for the reference praw.", "that was only in 3.6 alpha. Fstrings are the fastest string concatenation method now.", "I am not sure where you got that information, f strings have been demonstrated to be extremely fast in all scenarios I’ve seen them tested in.", "[deleted]", "Hmm, but if the rate limit is, let's say, 100 calls in 15m, then praw will probably let you do 100 calls in 30s, and then lock you out for the remaining 14m, right?\n\nStill good to have reasonable sleep regardless. There's no point in updated every second.", ">Should I use urllib instead of requests?\n\nNope. If you read the description from the docs:\n\n>is a package that collects several modules for working with URLs\n\nYou will notice that is **not** their goal to help you **consume** web **services**. urllibs consume you manipulate url and web requests and a \"raw\" way. Requests project had a different goal. Two projects, same scenario, different scopes and goals.", "Python\n\nReddit\n\nAPI\n\nWrapper\n\nhttps://praw.readthedocs.io/en/latest/\n\nhttps://pypi.org/project/praw/", "C-style is still faster last I checked.", "Always thought so, read an article long time ago, and always assumed so.", "awesome. don't see myself ever using it, but if ever do need a reddit api I know what to use!", "It's actually pretty smart! The rate limit is 600 requests in 10 minutes, and PRAW chooses how long to sleep such that the requests will be evenly spread out across the timeframe.", "I have an API wrapper that won't let you make a second request until 0.2 seconds have elapsed since the previous request. I imagine something similar would work here.", "I think I might not be communicating my point well to you and perhaps I am misunderstanding yours. \n\nI like packages that make my developer life better, faster, more effective. yes, the core lib can do everything because everything is built on the core lib. I use external packages because the abstractions are helpful. \n\nPython's success is due to developer efficiency and a core part of that is constant growth and improvement of packages.", "Thank you kind sir.", "interestingly, that is not true anymore. Here is the realpython article on it: https://realpython.com/python-f-strings/\n\nedit: f-strings are the fastest and most readable way to do string interpolation.", "We are 100% on the same page mate. Almost every single library on Python offers a monstrous level of efficiency for developers and it's hard to see that on other languages.\n\nI guess what made is diverge a little was my philosophy on building apps/libs: I Like to \"try follow\" the Unix philosophy. When I say that I \"try it\" means I know that at some point a particular the app/lib will may need to outgrown it.\n\nSo for initial development cycles I try to keep it tight, simple and \"monolithic\". Sure after a couple of iterations we will see some issues being raised that will clearly need either: a external lib or a new internal lib. Depending on the complexity of the issue I will try using the core libs only, but if after one or two iterations it's not showing progress i will jump straight to a reusable module and maybe think about rewrite the solution later (much later) to reduce dependencies (or not. depends on how mature and used the lib is).\n\nAll that with the perspective that we will need to grow the level of external dependencies along the road but not without a try on create my own solution.", "oh sweet! I agree. However, I do like some packages right from the beginning for some standard types of projects where its a common template. CLIs are one of those common types of projects. \n\nIt seems to me that if we diverge philosophically in any area, I think its what try to stay true towards? It seems to me that you try to stay close to the core lib at the beginning of a project, where I prefer to stay close to a \"standard\" approach to that kind of project. \n\nIf I find a package makes doing those kinds of projects easier and it is well supported, I would include it in my standard approach to those projects.\n\nI think we ecstatically agree that external dependencies can be a vulnerability if people just throw any package into a project.\n\nbut yeah, Python-fire is really good."]},
{"title": "Need ideas for Final Year Project!\n", "ID": "1cjy00j", "author": "ClassyPaints", "url": "https://www.reddit.com/r/Python/comments/1cjy00j/need_ideas_for_final_year_project/", "permalink": "/r/Python/comments/1cjy00j/need_ideas_for_final_year_project/", "score": 1, "ratio": 0.57, "num_comments": 2, "post_created": 1714821641.0, "body": "I am in my final year of university, and we have to create a project related to AI and web but web is not compulsory, any good ideas related to AI projects that i can create which are not too difficult to create for a university level student.", "external_links": [{"title": "OP.GG - The Best LoL Builds and Tier List. Search Riot ID and Tagline for Stats", "description": "OP.GG - The Best LoL Builds and Tier List. Search Riot ID and Tagline for StatsLeague of LegendsBGamesDesktopTeamfight TacticsValorantPUBGBPalworldOVERWATCH2EsportsNGigsDuoTALKzendeskContact UsHelp CenterContact UsTheme Buttonen_USEnglish한국어日本語język polskifrançaisDeutschespañolNederlandsdanskSvenskaNorskрусский языкmagyarsuomiTürkçelimba românăportuguês简体中文繁體中文العربيةсрпски језикitalianoไทยTiếng ViệtEnglishLog InHomeChampionsGame ModeArenaUStatsLeaderboardsPro MatchesMulti-SearchMy PageOP.GGRegionnaNAEUWEUNEOCEKRJPBRLASLANRUTRSGPHTWVNTHNorth AmericaSearchGame Name +#NA1.GGOP.GGAbout OP.GGCompanyBlogLogo HistoryProductsLeague of LegendsGamesTeamfight TacticsValorantPUBGOVERWATCH2EsportsGigsDuoTALKAppsOP.GG for DesktopOP.GG Palworld for DesktopOP.GG Stats for AndroidOP.GG Stats for iOSOP.GG TFT for AndroidOP.GG TFT for iOSResourcesPrivacy PolicyTerms of UseHelpEmail InquiryContact UsMoreBusinessAdvertise© 2012-2024 OP.GG. OP.GG is not endorsed by Riot Games and does not reflect the views or opinions of Riot Games or anyone officially involved in producing or managing League of Legends. League of Legends and Riot Games are trademarks or registered trademarks of Riot Games, Inc. League of Legends © Riot Games, Inc.", "url": "https://op.Gg"}, {"title": "OP.GG - The Best LoL Builds and Tier List. Search Riot ID and Tagline for Stats", "description": "OP.GG - The Best LoL Builds and Tier List. Search Riot ID and Tagline for StatsLeague of LegendsBGamesDesktopTeamfight TacticsValorantPUBGBPalworldOVERWATCH2EsportsNGigsDuoTALKzendeskContact UsHelp CenterContact UsTheme Buttonen_USEnglish한국어日本語język polskifrançaisDeutschespañolNederlandsdanskSvenskaNorskрусский языкmagyarsuomiTürkçelimba românăportuguês简体中文繁體中文العربيةсрпски језикitalianoไทยTiếng ViệtEnglishLog InHomeChampionsGame ModeArenaUStatsLeaderboardsPro MatchesMulti-SearchMy PageOP.GGRegionnaNAEUWEUNEOCEKRJPBRLASLANRUTRSGPHTWVNTHNorth AmericaSearchGame Name +#NA1.GGOP.GGAbout OP.GGCompanyBlogLogo HistoryProductsLeague of LegendsGamesTeamfight TacticsValorantPUBGOVERWATCH2EsportsGigsDuoTALKAppsOP.GG for DesktopOP.GG Palworld for DesktopOP.GG Stats for AndroidOP.GG Stats for iOSOP.GG TFT for AndroidOP.GG TFT for iOSResourcesPrivacy PolicyTerms of UseHelpEmail InquiryContact UsMoreBusinessAdvertise© 2012-2024 OP.GG. OP.GG is not endorsed by Riot Games and does not reflect the views or opinions of Riot Games or anyone officially involved in producing or managing League of Legends. League of Legends and Riot Games are trademarks or registered trademarks of Riot Games, Inc. League of Legends © Riot Games, Inc.", "url": "https://op.Gg"}], "comments": ["Check out Product Hunt to discover interesting AI-powered products. They'll give ideas for what your team can create.", "Build a GPT2 model, build a web scraper to harvest data about your city / area, train it on this data, and then host it on an API to be like a tourist guide for your area. You could add some OCR to input texts from your university history books etc.\n\nFor brownie points, write your own back propagation and training functions etc.\n\nFor added fun, hook up a weather API so you can ask for advice on activities to do, and it will check the weather and use that information to influence the suggested activities."]}]