[{"title": "Sunday Daily Thread: What's everyone working on this week?", "ID": "1cestbe", "author": "AutoModerator", "url": "https://www.reddit.com/r/Python/comments/1cestbe/sunday_daily_thread_whats_everyone_working_on/", "permalink": "/r/Python/comments/1cestbe/sunday_daily_thread_whats_everyone_working_on/", "score": 3, "ratio": 0.64, "num_comments": 15, "post_created": 1714262413.0, "body": "# Weekly Thread: What's Everyone Working On This Week? 🛠️\n\nHello /r/Python! It's time to share what you've been working on! Whether it's a work-in-progress, a completed masterpiece, or just a rough idea, let us know what you're up to!\n\n## How it Works:\n\n1. **Show & Tell**: Share your current projects, completed works, or future ideas.\n2. **Discuss**: Get feedback, find collaborators, or just chat about your project.\n3. **Inspire**: Your project might inspire someone else, just as you might get inspired here.\n\n## Guidelines:\n\n* Feel free to include as many details as you'd like. Code snippets, screenshots, and links are all welcome.\n* Whether it's your job, your hobby, or your passion project, all Python-related work is welcome here.\n\n## Example Shares:\n\n1. **Machine Learning Model**: Working on a ML model to predict stock prices. Just cracked a 90% accuracy rate!\n2. **Web Scraping**: Built a script to scrape and analyze news articles. It's helped me understand media bias better.\n3. **Automation**: Automated my home lighting with Python and Raspberry Pi. My life has never been easier!\n\nLet's build and grow together! Share your journey and learn from others. Happy coding! 🌟", "external_links": [], "comments": ["Well, I guess I'll go first. I'm very new here, so I'm just working my way through the Python W3Schools tutorials.", "I've just added more layers to things and am thinking about ways to improve performance.\n\n[https://github.com/therealOri/PolyLock](https://github.com/therealOri/PolyLock)", "**Adding orjson support to python-json-logger** - strictly speaking this is on my fork of the library (see [#1](https://github.com/nhairs/python-json-logger/issues/1) for details)\n\nThe actual pr is here if anyone wants to provide feedback: https://github.com/nhairs/python-json-logger/pull/9", "Calculating average salaries for data scientists https://github.com/werowe/HypatiaAcademy/blob/master/pandas/pandas_statistics.ipynb", "I'm working on setting up a Local RAG for lanchain docs cz i'm first of all too lazy to read through docs everytime i need to find something, and on top of that, i'm too cheap to pay OpenAI for inference ![gif](emote|free_emotes_pack|grin)", "Working on tach! [https://www.reddit.com/r/Python/comments/1cgsopt/tach\\_a\\_python\\_tool\\_to\\_enforce\\_modular\\_design/](https://www.reddit.com/r/Python/comments/1cgsopt/tach_a_python_tool_to_enforce_modular_design/)", "Turning my python code into HTML/CSS/JS", "I want to create a database with tasks displaying common scenarios in Python for study.", "Automation + Web Scraping: Built a script to scrape  property address and rent data from zillow clone website and automated the data entry into google forms . This project was part of :100 Days of Code: The Complete Python Pro Bootcamp course on Udemy.", "Learning how to run my python automation inside a docker container.", "Final project for my BSc in Contemporary Software Development. A Python + Flask app intended for small agricultural operations (farms, homesteads, or just the vegetable patch in your back yard) that lets users record what happens and what they do, and then lets them ask questions of their own data in natural language. Using some local NLP and the Google TaPas model deployed on HuggingFace.", "This week, I've been working on PgQueuer, a Python job queue library using PostgreSQL. It manages concurrent jobs, recently handling over 5,000 jobs per second in benchmark tests. Check it out and share any feedback! \\[PgQueuer on GitHub\\](https://github.com/janbjorge/PgQueuer)", "Same 🤙🏼", "Oh this project looks interesting - especially for closed source code that is released to customers", "\nI see you've posted a GitHub link to a Jupyter Notebook! GitHub doesn't \nrender large Jupyter Notebooks, so just in case, here is an \n[nbviewer](https://nbviewer.jupyter.org/) link to the notebook:\n\nhttps://nbviewer.jupyter.org/url/github.com/werowe/HypatiaAcademy/blob/master/pandas/pandas_statistics.ipynb\n\nWant to run the code yourself? Here is a [binder](https://mybinder.org/) \nlink to start your own Jupyter server and try it out!\n\nhttps://mybinder.org/v2/gh/werowe/HypatiaAcademy/master?filepath=pandas%2Fpandas_statistics.ipynb\n\n\n\n------\n\n^(I am a bot.) \n[^(Feedback)](https://www.reddit.com/message/compose/?to=jd_paton) ^(|) \n[^(GitHub)](https://github.com/JohnPaton/nbviewerbot) ^(|) \n[^(Author)](https://johnpaton.net/)"]},
{"title": "Lad wrote a Python script to download Alexa voice recordings, he didn't expect this email.", "ID": "g53lxf", "author": "iEslam", "url": "https://i.redd.it/2s0dj8ob12u41.png", "permalink": "/r/Python/comments/g53lxf/lad_wrote_a_python_script_to_download_alexa_voice/", "score": 12342, "ratio": 0.98, "num_comments": 133, "post_created": 1587424299.0, "body": "", "external_links": [], "comments": ["I’ll be honest, I was expecting a Cease and Desist from Amazon.", "Very cool. That’s the beauty of sharing. You never know who or how it will help someone, but you post it anyway because that’s just being awesome. \n\nThanks for sharing.", "This was posted publicly by [Michael Haephrati](https://www.facebook.com/photo.php?fbid=10220524693682311) on Facebook.\n\nUpdate: The lad is a Redditor! [**u/haephrati**](https://www.reddit.com/user/haephrati/)\n\nUpdate: The lad turned it into a [Software](https://www.facebook.com/pg/accexa2020/about/?ref=page_internal)!", "I feel that. It must be gratifying to do some good in the world, even if by accident. To diminish another's suffering just a little bit. RIP Mrs. Roberts.", "reminds me of that black mirror episode", "Beautiful! :-)", "If he has enough recording, he can ask a machine learning specialist to train a voice model of his mum.", "[deleted]", "AWWW!", "To be a hero, you don't need to save all the people.\n\nYou saved even only one person, to that person, you are the Hero.....", "Very nice!", "Heartwarming.", "I expected this to be way worse and be an email from Amazon warning him to cut the shit out. This is sweet and I'm glad he got a bit of comfort out if it.", "[deleted]", "Combine the voice recordings with Adobe's voice AI thing that can recreate a voice using just a few samples and he/she could have 'text to voice' mom audio!", "wow, that's awesome", "Coding can be used for whackadoodle stuff, but it is so nice to see when it is used for something wholesome, intentionally or not.", "On the one hand, that’s incredibly sweet, and it’s great to see how tech can positive impact people. On the other hand.. voice recordings taken without your knowledge? Personally wouldn’t want anyone keeping those unless I knew of it and consented at any given time I was being recorded. I wonder how much choice we’ll actually have in the matter in the next few years.", "I love my mom. (I am not the OP, this post made me emotional for some reason).", "Nobody's going to mention that Alexa is actually recording what you're saying? .... Seems like an invasion of privacy", "Think how much spam this guy must have gotten. You exposed your own and his email. lol.", "r/blackmirror", "I lost my mom when I was 14...i would do anything to hear her voice once again. \n\nKudos kid, you have done an awesome thing here, trust me.", "Shouldn't those recording be in a GDPR-mandated takeout archive without requiring a custom script?", "Just wait until Bezos realizes there there may be a demand for it.  \n\nFor only 14.95/month*** you can have your Amazon Elexa trained to respond in the voice of a dead loved one.\n\n\n*** Amazon prime membership required", "My mom passed almost 5 years ago and I wish this was a thing back then... That is a big deal as I don't have many recodings of her.", "When I saw Python, my dumb ass thought he wrote a Monty Python script.", "[deleted]", "That's awesome!", "Wholesome as fuck!  Thanks for sharing!!!", "Wow, that's awesome.", "❤️", "Man i would throw in an award if i had", "Maybe he will also be interested in the new [AI cloning voice](https://www.youtube.com/watch?v=0sR1rU3gLzQ) options out there.", "Omg a smart house situation.", "Now that it’s out there and people have seen it they’re filling and submitting it today.  People will have forgotten about it by the time someone looks at the cease n d’sis and these words will all be erased with grandma and us too", "The last good recording of my mom’s pre-stroke speech patterns is my parents’ home answering machine. My dad didn’t replace it until he absolutely had to.  When it was ready to die, thankfully I could still get the speaker to play loudly enough that you could hear it.\n\nThey don’t use a local answering machine anymore (thanks, Xfinity), but we have it. It’s been 20 years come August.", "This is so wholesome it made my day", "Can you imagine leaving your loved ones a surprise message in the recordings to be found later?", "I curse at Alexa when she doesn't do what I want, which is basically all the time.  It's interesting to think about someone archiving those recordings and listening to them fondly after I've died.", "Crying. Wish I could have had this for my dad.", "The September 19 2019 episode of the Endless Thread podcast describes a similar case.", "With NNs we our loved ones will live on.", "I have an Amazon Echo dot and have used it to ask it questions. What exactly are \"Alexa Voice Recordings\"? Does everything I ask it get recorded and archived somewhere that I can later download?", "Everyone likes that", "F", "NGL this one made me tear up a bit. That’s just awesome.", "*phew* boi. That escalated quickly!", "Oh crap, I need to add Alexa to my dead man's handle. My family isn't ready.", "Clickbait-like title.", "This gave me chills. Python FTW!", "That’s truly amazing. I’m so glad that your work helped someone out this much. Good for you.. and them 🙂", "Dang, thats so good!", "At the beginning I thought Alexa sent this email or something scary", "I twitted a screenshot of this to Bezos. Lets see if he responds. Haha", "Nice", "honestly i was expecting a job offer from amazon or smth like that, good job though", "*Forward 10 years:* Lad wrote a Python script to create a Alexia personality based on Alexia voice recordings of his long passed mother. Regrettably like his real life mother who nagged him  his entire life  the Alexia personality nagged him every time he made a purchase from Amazon or watched a movie. The man despondent  committed suicide by hanging, while the Alexia personality repeated,*\" I told you so\"* over and over again.", "[deleted]", "Why didn’t you blank out his name and his email completely? You can totally still read his email, and confirm this with his name. I would suggest you take this image offline", "as someone whos starting to learn python this gives me a good motivation thanks", "omg me too!", "That's the next email in his inbox.", "[deleted]", "it's never too late, don't give them ideas\n\nI'll be honest, I was expecting that Amazon could be nice to that poor guy and just send him an archive with all the recordings", "Same haha", "Yeah!", "Same", "hear, hear", "100% same", "OMG same", "That's what I was waiting for. That's an awesome unexpected response", "I didn't know it was possible to recover voice recordings. Is this possible with Siri? I've asked Siri questions while balls deep before.", "Link to the script?", "[deleted]", "Which one again? I'm guessing Be Right Back but feels different.", "I'm getting flashbacks to the episode of how I met your mother where Marshall only has a voice message from his dad...", "We're like 2 steps away from Black Mirror universe.", "Such as this one\n\nhttps://youtu.be/DWK_iYBl8cA", "There are an app that can make a chat bot based on a chat history, too.", "Not the only thing it recorded his mom doing", "\"Not all hero's wear capes\" (and I'm not trying to be funny, this was in all seriousness)", "Or the recordings could have been embarrassing. \"Alexa, what's the spit roast position?\"", "You can listen back to them on the website and provide feedback about whether Alexa did what you asked her to.", "I've been working towards this very thing. I have a short answering machine recording from my now deceased mother.  The \"Deep Fake\" algorithms have been what I'm targeting to use.  Just starting this so not far yet.  So many projects, so little time!", "Well, people do accept it by accepting the terms...", "I thought I couldn't be the only one who thinks this is more creepy than adorable. The bigger implications are right under your nose.", "You'd have to be pretty gullible to believe this wasn't happening", "It should be. Even if that were the case, I don't think the respondent is European.", "None of this is okay but we're gonna call it heartwarming because it's about a mom", "well not too dumb considering python is named that because of Monty Python", "Yeah... ever heard of \"My Activity\"?", "𝓷𝓲𝓬𝓮 ☜(ﾟヮﾟ☜)\n#Nice Leaderboard\n**1.** `u/spiro29` at **9999 nices**\n\n**2.** `u/RepliesNice` at **8923 nices**\n\n**3.** `u/Manan175` at **7099 nices**\n\n**...**\n\n**247777.** `u/sachin_55` at **1 nice**\n\n---\n\n^(I) ^(AM) ^(A) ^(BOT) ^(|) ^(REPLY) ^(**!IGNORE**) ^(AND) ^(I) ^(WILL) ^(STOP) ^(REPLYING) ^(TO) ^(YOUR) ^(COMMENTS)", "What?", "There's no need to be cynical, I can't cash out that karma if I wanted to and my children won't inherit it, the \"lad\" knows about this thread, he was also [credited](https://www.reddit.com/r/Python/comments/g53lxf/lad_wrote_a_python_script_to_download_alexa_voice/fo12gp8/), it gave him so much motivation, he turned his script into a [Software](https://www.facebook.com/pg/accexa2020/about/?ref=page_internal).", "I as well haha", "me too haha", "[deleted]", "> If you have posted something on Facebook and later published it elsewhere, Facebook has the legal ground to sue you\n\nThis is a myth, you're just repeating silly internet conspiracy theories.", "As others have pointed out, your FaceBook post example is wrong. Think about it this way, if a tech company were to claim what you post is legally theirs, every single post on their platform is a liability to them. They wouldn’t want to be sued for what you posted; that’s why they try to police their services.", "You can download all your data from Facebook in bulk for years by now.", "Or you looked into it too much and became a bit too paranoid, like a lot of guys who were paranoid about governments of representative democracies, and less paranoid about totalitarian governments or powerful corporations who collect everything without any limits.\n\nYes Alexa, and other systems collect too much data, but the principle should be about when they do something wrong with that information, i.e., the abuse of information. It's impossible to stop them from recording data.", "I work for Alexa and I would be happy to facilitate that. I don't have access to these things but I can drive a project to make it easier. Maybe even make the Python script work for everybody.", "Balls deep in Siri?", "At least for Google you can go back and listen to everything you told Google. Even just using text to speech. Pretty creepy", " [https://www.codeproject.com/Articles/5249524/Hacking-Alexas-Voice-Recordings](https://www.codeproject.com/Articles/5249524/Hacking-Alexas-Voice-Recordings)", "I’m a bit confused, in what ways are “David’s” personal details exposed?", "Where she loses her husband", ">Be Right Back\n\nIt was actually smithereens", "Ive already trained a model of my own voice. I just need to give it a brain", "This is concerning.", "[removed]", "And buying the thing...", "It's not feasible to limit GDPR takeout to europeans, so it is usually available to all.", "Really? Nice!", "\n\nHow long would it take the Amazon's engineers to create a AI based on past Alexia voice recordings? I based this idea or short story on this articles. \n\n[A Son’s Race to Give His Dying Father Artificial Immortality](https://www.wired.com/story/a-sons-race-to-give-his-dying-father-artificial-immortality/)\n\nhttps://www.npr.org/2017/07/23/538825555/creating-a-dadbot-to-talk-with-a-dead-father", "[deleted]", "The only ones I know if that actually do claim copyright are Stack Overflow and Wikipedia, and they claim copyright but licence it under a FLOSS licence.", "Yeah.  The reality is actually the reverse: if *Facebook* uses the material elsewhere, *you don't* have the grounds to sue *them* (if the agreement is upheld, anyway).\n\nIOW, you aren't agreeing to limit your own use; you are agreeing *not* to limit FB's.\n\nWhich is also pretty shit, and quite inline with the unofficial motto they've always had: *Fuck privacy.  Everything about you should be 100% public, always...especially in terms of access by government surveillance agencies and big business.*", "[deleted]", "Don't worry about it", "His email address?", "Well you get his full name", "Okay so that's the one.", "How did you do it .Any resources you can point me to?", "Certainly!  I've been focusing more GUI solutions for video based AI problems, but now that you've reminded me of this project, I'll keep an eye out for this audio one as well.  I could just as easily add a GUI front-end to an audio tool.  Thanks for the reminder.  It's back on my radar again.", "...and not really thinking about what they accepted.. and shouldn’t there be an opt out?", "Didn't know that. Thanks for clearing that up for me.", "The documentation is also filled with Monty Python'isms.\n\nThe debugger is called Idle, for a certain member of the clan, as well.", "Haha yeah, despite the icon being a snake, Monty Python is the origin.\n\nhttps://docs.python.org/3/tutorial/appetite.html\n\n>By the way, the language is named after the BBC show “Monty Python’s Flying Circus” and has nothing to do with reptiles. Making references to Monty Python skits in documentation is not only allowed, it is encouraged!\n\nhttps://wiki.python.org/moin/CheeseShop\n\n>The secret code name refers to the Cheese Shop sketch performed and recorded by John Cleese and Michael Palin on 7 January 1972.", "nice", "[deleted]", "If you want an example of a \"We own everything license\" check out Grammerley. I won't touch them with a barge pole.", "Unless the EU can watch over them while they do it, my bigger worry is about bad guys, who will say \"sure we deleted it\" and then don't.", "I get the feeling that the name \"David Roberts\" doesn't really narrow it down enough to actually dox the man.  That's a super generic name.", "Any update??", "Nope, it's common knowledge that big companies will store anything you do..", "𝓷𝓲𝓬𝓮 ☜(ﾟヮﾟ☜)\n#Nice Leaderboard\n**1.** `u/RepliesNice` at **7119 nices**\n\n**2.** `u/spiro29` at **6133 nices**\n\n**3.** `u/GreenAppleCZ` at **5081 nices**\n\n**...**\n\n**270019.** `u/ashhy-ashhy` at **1 nice**\n\n---\n\n^(I) ^(AM) ^(A) ^(BOT) ^(|) ^(REPLY) ^(**!IGNORE**) ^(AND) ^(I) ^(WILL) ^(STOP) ^(REPLYING) ^(TO) ^(YOUR) ^(COMMENTS)", "[deleted]", "[deleted]", "Erm some people will assume the worst, but others assume companies will respect you and your rights.. doesn’t come out nicely for the latter group", "my first nice :)", "[deleted]", "* Regulations without teeth are called bad regulations.\n* Regulations without verification are bad regulations.\n* Regulations designed to snuff out capitalist competition are called monopolizing regulations and are bad regulations.\n* Regulations that give you a false sense of security, while giving popularity and votes to the politician who wrote them, are called bad regulations or fake regulations.", "[deleted]", "[deleted]", "[deleted]", "You're stupid if you think those fines mean they are abiding by it. How utterly stupid do you have to be to think they are being honest there. They probably pay the fines because it's way cheaper than the profit they make just to continue to stay in the good graces of some.\n\nHow utterly stupid do you have to be? Do you think the Irish police go in there and check exactly what they're doing? Nope. If they wanna hide it, they can easily hide it. It's because of stupid people like you who think these laws work.\n\nIf they did something truly bad that could get them in serious legal heat, they'll be like \"woops we lost all the harddrives.\"\n\nThe whole point, because you're so incredibly stupid that you didn't even understand, is that regulations must have teeth and must be very good at investigation.", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]", "[deleted]"]},
{"title": "Need ideas for Final Year Project!\n", "ID": "1cjy00j", "author": "ClassyPaints", "url": "https://www.reddit.com/r/Python/comments/1cjy00j/need_ideas_for_final_year_project/", "permalink": "/r/Python/comments/1cjy00j/need_ideas_for_final_year_project/", "score": 1, "ratio": 0.57, "num_comments": 2, "post_created": 1714821641.0, "body": "I am in my final year of university, and we have to create a project related to AI and web but web is not compulsory, any good ideas related to AI projects that i can create which are not too difficult to create for a university level student.", "external_links": [], "comments": ["Check out Product Hunt to discover interesting AI-powered products. They'll give ideas for what your team can create.", "Build a GPT2 model, build a web scraper to harvest data about your city / area, train it on this data, and then host it on an API to be like a tourist guide for your area. You could add some OCR to input texts from your university history books etc.\n\nFor brownie points, write your own back propagation and training functions etc.\n\nFor added fun, hook up a weather API so you can ask for advice on activities to do, and it will check the weather and use that information to influence the suggested activities."]}]